In [63]:
%load_ext sql
%sql sqlite:///resultado.sqlite

import pandas as pd
import sqlite3
print(sqlite3.sqlite_version)

conn = sqlite3.connect("resultado.sqlite")  # ou :memory:
pd.read_sql_query("""
SELECT name AS table_name
FROM sqlite_master
WHERE type = 'table'
ORDER BY name
""", conn)

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
3.50.4

   table_name
0     commits
1  filestests
2     metrics
3  testsmells

In [64]:
pd.read_sql_query("""
-- 1115938
select count(1) as "quantidade total de testsmells" from testsmells t;
""", conn)

   quantidade total de testsmells
0                         1115938

In [65]:
pd.read_sql_query("""
-- 36138
select count(1) as "ocorrencia de test smells negativo" from testsmells t where t.score < 0;
""", conn)

   ocorrencia de test smells negativo
0                               36138

In [66]:
pd.read_sql_query("""
-- 1079800
select count(1) as "ocorrencia de test smells positivos" from testsmells t where t.score > 0;
""", conn)

   ocorrencia de test smells positivos
0                              1079800

In [67]:
pd.read_sql_query("""
-- 1079800
select count(1) as "ocorrencia de test smells neutros" from testsmells t where t.score = 0;
""", conn)

   ocorrencia de test smells neutros
0                                  0

In [68]:
pd.read_sql_query("""

-- Score de negatividade por testsmells
SELECT distinct (testsmell),
    sum(score)
FROM testsmells
where
    score < 0
group by
    testsmell;

""", conn)

                   testsmell  sum(score)
0         Assertion Roulette    -13453.0
1     Conditional Test Logic     -1060.0
2           Duplicate Assert    -21420.0
3                 Empty Test       -23.0
4         Exception Handling      -598.0
5               Ignored Test       -10.0
6               Magic Number    -22424.0
7     Print Statment Fixture      -184.0
8          Resource Optimism      -329.0
9         Sensitive Equality      -393.0
10            Sleepy Fixture      -203.0
11  Test Without Description        -2.0
12              Unknown Test     -1231.0
13              Verbose Test      -867.0

In [69]:
pd.read_sql_query("""
-- média dos sentimentos negativos por testsmell

SELECT testsmell, AVG(CAST(score AS REAL)) as media_score
FROM testsmells
GROUP BY
    testsmell
ORDER BY media_score ASC;

""", conn)

                   testsmell  media_score
0   Test Without Description     0.066667
1         Exception Handling     0.101420
2               Ignored Test     0.105263
3             Sleepy Fixture     0.162127
4          Resource Optimism     0.168956
5     Conditional Test Logic     0.179233
6           Duplicate Assert     0.198977
7               Magic Number     0.199565
8     Print Statment Fixture     0.216864
9               Unknown Test     0.218408
10              Verbose Test     0.229982
11        Assertion Roulette     0.231893
12        Sensitive Equality     0.294579
13                Empty Test     0.318471

In [70]:
pd.read_sql_query("""


SELECT testsmell, COUNT(score) as quantidade
FROM testsmells
WHERE
    CAST(score AS REAL) < 0
GROUP BY
    testsmell;


""", conn)

                   testsmell  quantidade
0         Assertion Roulette        8052
1     Conditional Test Logic         522
2           Duplicate Assert       11719
3                 Empty Test          14
4         Exception Handling         341
5               Ignored Test           7
6               Magic Number       13582
7     Print Statment Fixture         106
8          Resource Optimism         203
9         Sensitive Equality         226
10            Sleepy Fixture         111
11  Test Without Description           2
12              Unknown Test         773
13              Verbose Test         480

In [71]:
pd.read_sql_query("""

-- soma dos sentimentos negativos
SELECT testsmell, SUM(CAST(score AS REAL)) as total_score
FROM testsmells
WHERE
    CAST(score AS REAL) < 0
GROUP BY
    testsmell
ORDER BY total_score ASC;

""", conn)

                   testsmell  total_score
0               Magic Number     -22424.0
1           Duplicate Assert     -21420.0
2         Assertion Roulette     -13453.0
3               Unknown Test      -1231.0
4     Conditional Test Logic      -1060.0
5               Verbose Test       -867.0
6         Exception Handling       -598.0
7         Sensitive Equality       -393.0
8          Resource Optimism       -329.0
9             Sleepy Fixture       -203.0
10    Print Statment Fixture       -184.0
11                Empty Test        -23.0
12              Ignored Test        -10.0
13  Test Without Description         -2.0

In [72]:
pd.read_sql_query("""

-- média dos sentimentos negativos por testsmell
SELECT testsmell, SUM(CAST(score AS REAL)) / COUNT(score) as media
FROM testsmells
WHERE
    CAST(score AS REAL) < 0
GROUP BY
    testsmell
ORDER BY media ASC;

""", conn)

                   testsmell     media
0     Conditional Test Logic -2.030651
1             Sleepy Fixture -1.828829
2           Duplicate Assert -1.827801
3               Verbose Test -1.806250
4         Exception Handling -1.753666
5         Sensitive Equality -1.738938
6     Print Statment Fixture -1.735849
7         Assertion Roulette -1.670765
8               Magic Number -1.651009
9                 Empty Test -1.642857
10         Resource Optimism -1.620690
11              Unknown Test -1.592497
12              Ignored Test -1.428571
13  Test Without Description -1.000000

In [73]:
pd.read_sql_query("""

-- soma dos sentimentos negativos por autor
SELECT author, SUM(CAST(score AS REAL)) as total_score
FROM testsmells
WHERE
    CAST(score AS REAL) < 0
GROUP BY
    author
ORDER BY total_score ASC;

""", conn)

               author  total_score
0        marcglasberg      -2221.0
1          Joe Conway      -2081.0
2      Remi Rousselet      -1753.0
3             rydmike      -1706.0
4    Marcelo Glasberg      -1645.0
..                ...          ...
773           greymag         -1.0
774         mastodon0         -1.0
775   ndesai-newrelic         -1.0
776       platypusguy         -1.0
777                sg         -1.0

[778 rows x 2 columns]

In [74]:
pd.read_sql_query("""

-- média dos sentimentos negativos por autor
SELECT author, SUM(CAST(score AS REAL)) / COUNT(score) as media
FROM testsmells
WHERE
    CAST(score AS REAL) < 0
GROUP BY
    author
ORDER BY media ASC;

""", conn)

                author  media
0     Alexander Emelin   -6.0
1           Jorge Coca   -6.0
2        Elijah Luckey   -5.0
3             mcmah309   -5.0
4      Abdelaziz Mahdy   -4.0
..                 ...    ...
773              yunik   -1.0
774             zoechi   -1.0
775  Łukasz Wiśniewski   -1.0
776                なつき   -1.0
777                김노트   -1.0

[778 rows x 2 columns]

In [75]:
pd.read_sql_query("""

-- quantidade de projetos por autor
SELECT author, COUNT(DISTINCT project_name) as quantidade
FROM testsmells
GROUP BY
    author
ORDER BY quantidade DESC limit 20;

""", conn)

                    author  quantidade
0              Kevin Moore          73
1               Nate Bosch          30
2       Natalie Weizenbaum          27
3            Felix Angelov          20
4              Devon Carew          19
5         nweiz@google.com          15
6              Jacob Moura          15
7           Remi Rousselet          14
8     Jochum van der Ploeg          14
9          Jacob MacDonald          14
10                 Alex Li          14
11                   Renan          13
12            David Martos          13
13                 unknown          12
14  Jonas Finnemann Jensen          12
15            Simon Binder          11
16             Sam Rawlins          11
17           Romain Rastel          11
18      Lasse R.H. Nielsen          11
19       Gabriel Terwesten          11

In [76]:
pd.read_sql_query("""

-- projetos por autor
select DISTINCT (ts.project_name)
from testsmells as ts
where
    ts.author like 'Kevin Moore'
limit 100;

""", conn)

          project_name
0              angular
1            appengine
2                 args
3                async
4          binary_tree
..                 ...
68                 web
69  web_socket_channel
70      webdriver.dart
71                yaml
72           yaml_edit

[73 rows x 1 columns]

In [ ]:
pd.read_sql_query("""

-- projetos por autor
select ts. from testsmells as ts;

""", conn)